#include <bits/stdc++.h>
using namespace std;

int main()
{
    // একটি list তৈরি
    list<int> l = {21, 36, 69, 84, 5, 78};

    // 🔹 begin() থেকে 3 ঘর সামনে যাওয়া
    // =====================================
    // index 0-based: 0->21, 1->36, 2->69, 3->84
    auto it = next(l.begin(), 3);
    cout << *it << " fix" << endl; // it এখন 84 এ আছে
    /*
        auto it = l.begin();   // শুরুতে গেলাম
        int position = 2;   // index (0-based)
        advance(it, position); // position পর্যন্ত এগোলাম
    */
    // =====================================
    auto nextIt = next(it); // 🔹 বর্তমান it থেকে ১ ঘর সামনে যাওয়া
    // ⚠️ next(it) মূল it কে পরিবর্তন করে না | শুধু নতুন iterator দেয়
    cout << *nextIt << " next" << endl; //
    // =====================================
    auto preIt = prev(it); // 🔹 বর্তমান it থেকে ১ ঘর পেছনে যাওয়া
    // ⚠️ prev(it) ও মূল it কে পরিবর্তন করে না
    cout << *preIt << " prev" << endl; // 69

    // =====================================
    // 🔹 নির্দিষ্ট পজিশনের মান পরিবর্তন
    // =====================================
    // begin থেকে 2 ঘর সামনে |  index 2 মানে 69
    auto repIt = next(l.begin(), 2);
    *repIt = 99; // value replace

    // এখন list হবে: 21 36 99 84 5 78

    cout << "After replace: ";
    for (int x : l)
        cout << x << " ";

    return 0;
}
