#include <iostream>
using namespace std;

int main()
{
    int x;
    /*
    cin >> x ইনপুট থেকে একটি সংখ্যা পড়ার চেষ্টা করে।

    যদি সফলভাবে সংখ্যা পড়তে পারে, তাহলে এটা true রিটার্ন করে → লুপ চলবে।

    যদি ইনপুট শেষ হয়ে যায়, অথবা ভুল ইনপুট আসে → এটা false রিটার্ন করে → লুপ বন্ধ হবে।
    */
    // 🔹 যতক্ষণ পর্যন্ত ইনপুট থেকে সংখ্যা পড়া যাবে
    while (cin >> x)
    {
        // 🔹 সংখ্যা স্ক্রিনে প্রিন্ট করো
        cout << x << endl;
    }

    return 0;
}

/*
    char s[100001];
    while (cin.getline(s, 100001))
    {
        int sLength = strlen(s);
        sort(s, s + sLength);
        for (int i = 0; i < sLength; i++)
        {
            if (s[i] != ' ')
            {
                cout << s[i];
            }
        }
        cout << endl;
    }
*/