#include <bits/stdc++.h> // সব স্ট্যান্ডার্ড লাইব্রেরি ইনক্লুড
using namespace std;

int main()
{
    int n;
    cin >> n; // কতগুলো সংখ্যা ইনপুট নেবে

    int a[n]; // n সাইজের অ্যারে তৈরি

    // অ্যারের প্রতিটি মান ইনপুট নেয়া
    for (int i = 0; i < n; i++)
    {
        cin >> a[i];
    }

    // -------------------------------
    // sort(a, a+n) কী করে?
    // 👉 a  = array-এর প্রথম element-এর pointer (a[0])
    // 👉 a+n = array-এর শেষ element-এর "পরের" position
    //
    // sort() এই range [a, a+n) এর মধ্যে সব element
    // ascending order এ ছোট থেকে বড় করে সাজায়।

    sort(a, a + n);

    //  sort(a, a + n, greater<int>()); // sort Descending order --> int is datatype

    // সাজানো array প্রিন্ট করা
    for (int i = 0; i < n; i++)
    {
        cout << a[i] << " ";
    }

    return 0;
}
